# Import Libraries and Read data

In [113]:
import pandas as pd 
import numpy as np

In [114]:
dic_data = {'string_col':['1','2','3','4'],
            'int_float_D':[1,2,3.2,4.6],
            'int_float_r':[1,2,3.2,4.6],
            'mix_col':['a','-2',3,4],
            'missing':[1,2,3,np.nan],
            'money':['$1,500.00','$3,436.45','$958.99','$1,198.00']
           }

In [115]:
df = pd.DataFrame.from_dict(dic_data)

In [116]:
df

  string_col  int_float_D  int_float_r mix_col  missing      money
0          1          1.0          1.0       a      1.0  $1,500.00
1          2          2.0          2.0      -2      2.0  $3,436.45
2          3          3.2          3.2       3      3.0    $958.99
3          4          4.6          4.6       4      NaN  $1,198.00

In [117]:
df1 = df.copy()

In [118]:
df1

  string_col  int_float_D  int_float_r mix_col  missing      money
0          1          1.0          1.0       a      1.0  $1,500.00
1          2          2.0          2.0      -2      2.0  $3,436.45
2          3          3.2          3.2       3      3.0    $958.99
3          4          4.6          4.6       4      NaN  $1,198.00

![separator2](https://i.imgur.com/4gX5WFr.png)

# Analysis Data Types of columns

In [119]:
df.dtypes

string_col      object
int_float_D    float64
int_float_r    float64
mix_col         object
missing        float64
money           object
dtype: object

## 1. string_col
```it consists of numbers but its data type is object so let's convert its data type to int```

In [120]:
df['string_col'] = df['string_col'].astype(int)

In [121]:
# another way using pd.to_numeric
# df1['string_col'] = pd.to_numeric(df1['string_col'])

In [122]:
df['string_col'].dtype

dtype('int32')

## 2. int_float_D
```convert this column to int with Round down```

In [123]:
df['int_float_D'] = df['int_float_D'].astype(int)

In [124]:
df['int_float_D'].dtype

dtype('int32')

In [125]:
df['int_float_D']

0    1
1    2
2    3
3    4
Name: int_float_D, dtype: int32

## 3. int_float_r
```convert this column to int with Round using number of decimal points```

In [126]:
df['int_float_r'] = df['int_float_r'].round(0).astype(int)

In [127]:
df['int_float_r'].dtype

dtype('int32')

In [128]:
df['int_float_r']

0    1
1    2
2    3
3    5
Name: int_float_r, dtype: int32

In [129]:
df.dtypes

string_col       int32
int_float_D      int32
int_float_r      int32
mix_col         object
missing        float64
money           object
dtype: object

In [130]:
df.head()

   string_col  int_float_D  int_float_r mix_col  missing      money
0           1            1            1       a      1.0  $1,500.00
1           2            2            2      -2      2.0  $3,436.45
2           3            3            3       3      3.0    $958.99
3           4            4            5       4      NaN  $1,198.00

## 4. mix_col
```its data type is object and i want to convert it to number but it contains string so use numeric on this col first```

### numeric

In [136]:
df1['string_col'] = pd.to_numeric(df1['string_col'])

In [137]:
df1

   string_col  int_float_D  int_float_r mix_col  missing      money
0           1          1.0          1.0       a      1.0  $1,500.00
1           2          2.0          2.0      -2      2.0  $3,436.45
2           3          3.2          3.2       3      3.0    $958.99
3           4          4.6          4.6       4      NaN  $1,198.00

In [138]:
df1.dtypes

string_col       int64
int_float_D    float64
int_float_r    float64
mix_col         object
missing        float64
money           object
dtype: object

### mix_col

In [139]:
df['mix_col'] = pd.to_numeric(df['mix_col'], errors='coerce')
# errors = 'corrce' force the values that cause errors (a) to be null

In [140]:
df['mix_col'].dtype

dtype('float64')

In [141]:
df.head()

   string_col  int_float_D  int_float_r  mix_col  missing      money
0           1            1            1      NaN      1.0  $1,500.00
1           2            2            2     -2.0      2.0  $3,436.45
2           3            3            3      3.0      3.0    $958.99
3           4            4            5      4.0      NaN  $1,198.00

In [142]:
df['mix_col'] = df['mix_col'].astype('Int64')

In [143]:
df['mix_col'].dtype

Int64Dtype()

In [144]:
df.head()

   string_col  int_float_D  int_float_r  mix_col  missing      money
0           1            1            1     <NA>      1.0  $1,500.00
1           2            2            2       -2      2.0  $3,436.45
2           3            3            3        3      3.0    $958.99
3           4            4            5        4      NaN  $1,198.00

In [145]:
df.isnull().sum()

string_col     0
int_float_D    0
int_float_r    0
mix_col        1
missing        1
money          0
dtype: int64

## 5. money
``` it has object data type and i want to make it number but before it i should get rid of dollar sign and , ```

In [195]:
df

   string_col  int_float_D  int_float_r  mix_col  missing      money
0           1            1            1     <NA>      1.0  $1,500.00
1           2            2            2       -2      2.0  $3,436.45
2           3            3            3        3      3.0    $958.99
3           4            4            5        4      NaN  $1,198.00

In [196]:
df['money'] = df['money'].str.strip('$')

In [197]:
df

   string_col  int_float_D  int_float_r  mix_col  missing     money
0           1            1            1     <NA>      1.0  1,500.00
1           2            2            2       -2      2.0  3,436.45
2           3            3            3        3      3.0    958.99
3           4            4            5        4      NaN  1,198.00

In [198]:
df['money'] = df['money'].str.replace(',','')

In [199]:
df

   string_col  int_float_D  int_float_r  mix_col  missing    money
0           1            1            1     <NA>      1.0  1500.00
1           2            2            2       -2      2.0  3436.45
2           3            3            3        3      3.0   958.99
3           4            4            5        4      NaN  1198.00

In [202]:
df['money'].dtype

dtype('O')

In [205]:
# Convert it to int
df['money'] = pd.to_numeric(df['money'])

In [206]:
df['money'].dtype

dtype('float64')

In [207]:
df['money'] = df['money'].astype(int)

In [208]:
df['money'].dtype

dtype('int32')

![separator2](https://i.imgur.com/4gX5WFr.png)

# Result

In [211]:
df

   string_col  int_float_D  int_float_r  mix_col  missing  money
0           1            1            1     <NA>      1.0   1500
1           2            2            2       -2      2.0   3436
2           3            3            3        3      3.0    958
3           4            4            5        4      NaN   1198

In [209]:
df.dtypes

string_col       int32
int_float_D      int32
int_float_r      int32
mix_col          Int64
missing        float64
money            int32
dtype: object